      *================================================================*
       IDENTIFICATION                                   DIVISION.
       PROGRAM-ID. PROGR001.
       AUTHOR.     SEBASTIAO ALVES.
      *================================================================*

      *================================================================*
       ENVIRONMENT                                      DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                       SECTION.
       SPECIAL-NAMES.
      *----------------------------------------------------------------*

       INPUT-OUTPUT                        SECTION.
       FILE-CONTROL.
      *----------------------------------------------------------------*

      *================================================================*
       DATA                                             DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE                                SECTION.

       WORKING-STORAGE                     SECTION.
       77 WRX-NOME                    PIC X(20) VALUE "SEBASTIAO-ALVES".

      *----------------------------------------------------------------*

      *================================================================*
       PROCEDURE                                        DIVISION.
           DISPLAY 'OLA MUNDO!'.
           DISPLAY 'OLA MUNDO2!'.
           DISPLAY WRX-NOME.
           STOP RUN.
