      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTE002.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77  NOME PIC 9(010).

       PROCEDURE DIVISION.

           PERFORM  5 TIMES
               DISPLAY 'OLA MUNDO'


           END-PERFORM

            STOP RUN.
       END PROGRAM TESTE002.
